For my initial investigation I'm using a plan that replaces EC2 instances, you can see in there plan there are a number of `(known after apply)` changes:

```
 # module.scenarios[0].aws_instance.example_2 must be replaced
-/+ resource "aws_instance" "example_2" {
      ~ ami                                  = "ami-0552499a7e7b17069" -> "ami-07c8095f365849684" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-2:540044833068:instance/i-00675698f414b3dfd" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-00675698f414b3dfd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
```

Interestingly these have a number of different states:

* Changed (`~`)
* Added (`-`)

There are also a few things like `hibernation` and `credit_specification.cpu_credits` which are being changed to `null`. I'm not sure why this might be, potentially these are read-only attributes or something?

## Tasks

* [ ] Investigate what is different in the JSON plan about (known after apply) resources
* [ ] Investigate what is common about `hibernation` and `credit_specification.cpu_credits` such that they are shown as being removed rather than known after apply
* [ ] Double check the behaviour for nested groups. It's very common for something like `ebs_block_device` to be considered "modified" (known after apply) with all of the attributes underneath being "added" (known after apply). We just need to make sure that we are handling this well